Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.GetExtrusionHandle
Gets the extruded solid handle generated for the family instance.
Returns:
The handle.  If the extrusion analysis failed for the family, this will be a handle with no value assigned.
Since:
2012

Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.GetCutPairOpenings
Gets the set of "openings" determined from the analysis of the instance geometry.
Returns:
The extra openings.
Since:
2012

Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.ExtraOffset
The extra offset determined from the geometry of the family instance.
Since:
2012

Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.MaterialId
The best material id determined for the family instance.
Since:
2012

Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults
This class represents the results of a geometric analysis of a family instance.
Remarks:
The analysis attempts to convert the geometry of the instance into a single extrusion with
additional extruded openings cutting the main solid.
Since:
2012